src/InformationRegisters/ТоварыВОборудовании.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>ТоварыВОборудовании</Name>
			<Comment>Сведения о товарах которые выгружаются в оборудование</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НомерЯчейки</Name>
					<Comment>Номер ячейки PLU</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МоментИзменения</Name>
					<Comment>Момент последнего изменения товара. Если момент больше чем "момент последней загрузки" оборудования, то этот товар надо выгрузить в оборудование</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВыполненаПечатьЦенников</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ГруппаТоваров</Name>
					<Comment>Группа товаров оборудования</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыТоваровОборудования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Comment>Штрих-код</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<Comment>Цены</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Comment>Цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>Тип цен, для которого хранятся цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Comment>Номенклатура для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры для которой сохраняются цены</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Поставщик, историю цен которого необходимо хранить. Если &lt;пусто&gt;, то цену установили мы.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/Штрихкоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>Штрихкоды</Name>
			<Comment>Штрихкоды объектов</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОсновнойШтрихкод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Запрет</Name>
					<Comment>Действия с этим объектом запрещены</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Короб</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕРПЗначениеСчетчика</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Штрихкод</Name>
					<Comment>Штрихкод</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект, которому принадлежит штрихкод (номенклатура, карточка, документ)</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:CatalogRef.ПрочиеАктивы</v8:Type>
						<v8:Type>cfg:DocumentRef.ПеремещениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.СписаниеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.Инвентаризация</v8:Type>
						<v8:Type>cfg:CatalogRef.Карточки</v8:Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплату</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>Единица измерения, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Comment>Характеристика номенклатуры, для которой установлен штрихкод</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/итГруппыКСОНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>итГруппыКСОНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Удалена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаКСО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.итГруппыНоменклатурыКСО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>Расчетная ставка НДС 18/118</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>Расчетная ставка НДС 10/110</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>Расчетная ставка НДС 20/120</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5</Name>
					<Comment>Ставка НДС 5%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС5_105</Name>
					<Comment>Расчетная ставка НДС 5/105</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7</Name>
					<Comment>Ставка НДС 7%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС7_107</Name>
					<Comment>Расчетная ставка НДС 7/107</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22</Name>
					<Comment>Ставка НДС 22%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС22_122</Name>
					<Comment>Расчетная ставка НДС 22/122</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>Ставки НДС</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ставка</Name>
					<Comment>Ставка налога на добавленную стоимость</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>idУКМ5</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ХарактеристикиНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ХарактеристикиНоменклатуры</Name>
			<Comment>Дополнительные характеристики номенклатуры</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
				<xr:Item>Catalog.ТипыНоменклатуры</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаИзготовления</Name>
					<Comment>Дата изготовления серии номенклатуры</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Comment>Срок годности</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СерийныйНомер</Name>
					<Comment>Серийный номер номенклатуры</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сертификат</Name>
					<Comment>Сертификат номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодтверждающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Качество</Name>
					<Comment>Категория качества номенклатуры</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Качество</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сортировка</Name>
					<Comment>Порядковый номер характеристики, по которому производиться сортировка элементов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Крепость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержаниеСахара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Негоциант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Comment>Полный текст строкового дополнительного реквизита</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Справки2ЕГАИС</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Справка2</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Справки2ЕГАИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/УКМ5Сервер/Ext/Module.bsl
#Область ВыгрузкаУКМ5

#Область Выгрузка_Налоговых_Групп

Процедура ВыгрузкаНалоговыхГрупп() Экспорт
	
	Соединение = ПолучитьПараметрыПодключения();	
	Метод = "/api/v1/import/taxGroups";
		
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаНалоговыхСтавок(); 
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	НомерСтроки = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//СтавкаНДСЧислом = ОбменСКонтрагентамиПереопределяемый.ПолучитьСтавкуНДСЧислом(ВыборкаДетальныеЗаписи.СтавкаНДС);
		
		Элементы = Новый Массив; 

		Атрибуты = Новый Массив; 
		Атрибуты.Добавить(Новый Структура("tax, percent", Новый Структура("name, id, priority", "НДС", 1, 1), ВыборкаДетальныеЗаписи.Ставка));
		
		Элементы.Добавить(Новый Структура("taxRates, isPreferential, advanceTaxId, id, delete, fpCode", 
										   Атрибуты, Ложь, 0,ВыборкаДетальныеЗаписи.idУКМ5, false, ""));
		
		CURL_Запрос = ПолучитьТелоКакJSON(Новый Структура("elements", Элементы));
		НовыйЗапросHTTP = ПодготовитьHTTPЗапрос(CURL_Запрос, Метод); 
		
		Ответ = Соединение.ОтправитьДляОбработки(НовыйЗапросHTTP);
		
		//Сообщить(Строка(Ответ.КодСостояния));		
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла; 	
	
КонецПроцедуры  

Функция ТекстЗапросаНалоговыхСтавок()
	
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	СтавкиНДС.Ставка КАК Ставка,
	        |	СтавкиНДС.idУКМ5 КАК idУКМ5
	        |ИЗ
	        |	Справочник.СтавкиНДС КАК СтавкиНДС
	        |ГДЕ
	        |	НЕ СтавкиНДС.Наименование ПОДОБНО ""%/%""";
	
КонецФункции 

#КонецОбласти

#Область Выгрузка_Товарных_Групп

Процедура ВыгрузкаТоварныхГрупп() Экспорт
	
	Элементы = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапросаТоварныхГрупп();
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		РодительГруппы = Строка(?(ВыборкаДетальныеЗаписи.РодительГруппы = 0, 0, ВыборкаДетальныеЗаписи.РодительГруппы.УникальныйИдентификатор()));
		НаименованиеТоварнойГруппы 	= ВыборкаДетальныеЗаписи.НаименованиеТоварнойГруппы;
		УникальныйИдентификаторГруппы 	= Строка(ВыборкаДетальныеЗаписи.ТоварнаяГруппа.УникальныйИдентификатор());       
		
		Атрибуты = Новый Массив; 		
		Элементы.Добавить(Новый Структура("owner, name, attributes, id, delete",
		РодительГруппы,     				
		НаименованиеТоварнойГруппы,     	
		Атрибуты,  					
		УникальныйИдентификаторГруппы,
		ВыборкаДетальныеЗаписи.ВидГруппыПомеченНаудаление,           				
		));
		
	КонецЦикла; 		
	
	Соединение = ПолучитьПараметрыПодключения(); 	
	Метод = "/api/v1/import/groupItems";
	
	СтруктураЗапросаСпециальногоВида = Новый Структура("elements", Элементы);
	
	СериализацияСтруктурыВCURL_Запрос = ПолучитьТелоКакJSON(СтруктураЗапросаСпециальногоВида);
	
	НовыйЗапросHTTP = ПодготовитьHTTPЗапрос(СериализацияСтруктурыВCURL_Запрос, Метод); 
	
	Ответ = Соединение.ОтправитьДляОбработки(НовыйЗапросHTTP);
	
	ЗаполнениеИнформацииОВыгрузки(Элементы);
	
	//Сообщить(Строка(Ответ.КодСостояния));		

КонецПроцедуры
	
Функция ТекстЗапросаТоварныхГрупп()
	
	//Возврат  "ВЫБРАТЬ
	//|	Номенклатура.Ссылка КАК ТоварныеГруппы,
	//|	Номенклатура.Наименование КАК Наименование,
	//|	Номенклатура.ПометкаУдаления КАК ПометкаУдаления
	//|ПОМЕСТИТЬ СписокТоварныхГрупп
	//|ИЗ
	//|	Справочник.Номенклатура КАК Номенклатура
	//|ГДЕ
	//|	Номенклатура.ЭтоГруппа
	////|	И Номенклатура.Код <> ""00-00000002""
	//|
	//|ИНДЕКСИРОВАТЬ ПО
	//|	ТоварныеГруппы
	//|;
	//|
	//|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	СписокТоварныхГрупп.ТоварныеГруппы КАК ТоварнаяГруппа,
	//|	ЕСТЬNULL(РодительТоварнойГруппы.Ссылка, 0) КАК РодительГруппы,
	//|	СписокТоварныхГрупп.Наименование КАК НаименованиеТоварнойГруппы,
	//|	СписокТоварныхГрупп.ПометкаУдаления КАК ВидГруппыПомеченНаудаление
	//|ИЗ
	//|	СписокТоварныхГрупп КАК СписокТоварныхГрупп
	//|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК РодительТоварнойГруппы
	//|		ПО СписокТоварныхГрупп.ТоварныеГруппы.Родитель = РодительТоварнойГруппы.Ссылка";
	
	
	Возврат "ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	ТоварыВОборудовании.Номенклатура КАК Номенклатура
	        |ПОМЕСТИТЬ ТоварыОборудованияПоЦенам
	        |ИЗ
	        |	РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Цены КАК Цены
	        |		ПО ТоварыВОборудовании.Номенклатура = Цены.Номенклатура
	        |			И (Цены.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка))
	        |			И (Цены.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	        |			И (Цены.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка))
	        |			И ТоварыВОборудовании.МоментИзменения < Цены.Период
	        |ГДЕ
	        |	ТоварыВОборудовании.МоментИзменения < Цены.Период
	        |	И ТоварыВОборудовании.ВыполненаПечатьЦенников = ИСТИНА
	        |	И Цены.ХарактеристикаНоменклатуры = ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	        |	И Цены.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	        |	И Цены.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
	        |	И Цены.Период <= &ТекущаяДата
	        |	И Цены.Активность
	        |
	        |ИНДЕКСИРОВАТЬ ПО
	        |	Номенклатура
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	спрНоменклатура.ИерархияАльтернативная КАК РодительНоменклатуры
	        |ПОМЕСТИТЬ ПервыйУровньРодителя
	        |ИЗ
	        |	ТоварыОборудованияПоЦенам КАК ТоварыОборудованияПоЦенам
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	        |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Штрихкоды КАК Штрихкоды
	        |			ПО спрНоменклатура.Ссылка = Штрихкоды.Объект
	        |		ПО ТоварыОборудованияПоЦенам.Номенклатура = спрНоменклатура.Ссылка
	        |ГДЕ
	        |	НЕ спрНоменклатура.ПометкаУдаления
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПервыйУровньРодителя.РодительНоменклатуры КАК РодительНоменклатуры,
	        |	ПервыйУровньРодителя.РодительНоменклатуры.Родитель КАК РодительНоменклатурыРодитель,
	        |	ПервыйУровньРодителя.РодительНоменклатуры.ПометкаУдаления КАК РодительНоменклатурыПометкаУдаления
	        |ПОМЕСТИТЬ СписокВидовНоменклатур
	        |ИЗ
	        |	ПервыйУровньРодителя КАК ПервыйУровньРодителя
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПервыйУровньРодителя.РодительНоменклатуры.Родитель,
	        |	ПервыйУровньРодителя.РодительНоменклатуры.Родитель.Родитель,
	        |	ПервыйУровньРодителя.РодительНоменклатуры.Родитель.ПометкаУдаления
	        |ИЗ
	        |	ПервыйУровньРодителя КАК ПервыйУровньРодителя
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПервыйУровньРодителя.РодительНоменклатуры.Родитель.Родитель,
	        |	ПервыйУровньРодителя.РодительНоменклатуры.Родитель.Родитель.Родитель,
	        |	ПервыйУровньРодителя.РодительНоменклатуры.Родитель.Родитель.ПометкаУдаления
	        |ИЗ
	        |	ПервыйУровньРодителя КАК ПервыйУровньРодителя
	        |
	        |ОБЪЕДИНИТЬ ВСЕ
	        |
	        |ВЫБРАТЬ
	        |	ПервыйУровньРодителя.РодительНоменклатуры.Родитель.Родитель.Родитель,
	        |	ПервыйУровньРодителя.РодительНоменклатуры.Родитель.Родитель.Родитель.Родитель,
	        |	ПервыйУровньРодителя.РодительНоменклатуры.Родитель.Родитель.Родитель.ПометкаУдаления
	        |ИЗ
	        |	ПервыйУровньРодителя КАК ПервыйУровньРодителя
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ РАЗЛИЧНЫЕ
	        |	СписокВидовНоменклатур.РодительНоменклатуры КАК ТоварнаяГруппа,
	        |	ВЫРАЗИТЬ(СписокВидовНоменклатур.РодительНоменклатуры.Наименование КАК СТРОКА(80)) КАК НаименованиеТоварнойГруппы,
	        |	ВЫБОР
	        |		КОГДА СписокВидовНоменклатур.РодительНоменклатурыРодитель = ЗНАЧЕНИЕ(Справочник.номенклатура.пустаяссылка)
	        |			ТОГДА 0
	        |		ИНАЧЕ СписокВидовНоменклатур.РодительНоменклатурыРодитель
	        |	КОНЕЦ КАК РодительГруппы,
	        |	СписокВидовНоменклатур.РодительНоменклатурыПометкаУдаления КАК ВидГруппыПомеченНаудаление
	        |ИЗ
	        |	СписокВидовНоменклатур КАК СписокВидовНоменклатур
	        |ГДЕ
	        |	НЕ(СписокВидовНоменклатур.РодительНоменклатуры = ЗНАЧЕНИЕ(Справочник.Номенклатура.пустаяссылка)
	        |				И СписокВидовНоменклатур.РодительНоменклатурыРодитель ЕСТЬ NULL)
			|	И НЕ СписокВидовНоменклатур.РодительНоменклатурыРодитель ЕСТЬ NULL";
	
	
КонецФункции 

#КонецОбласти


#Область Выгрузка_Товаров

Процедура ВыгрузкаДанныхОТоварах(Оборудование, ПолнаяВыгрузка = Истина, ЭтоКлиент = Истина, МоментПоследнейЗагрузки, Результат, ТекстОшибки) Экспорт
    
    // Получаем данные в формате API
    ДанныеДляAPI = ПодготовитьДанныеДляAPI(
        Оборудование,
        ПолнаяВыгрузка,
        ЭтоКлиент,
        МоментПоследнейЗагрузки
    );
    
	Соединение = ПолучитьПараметрыПодключения(); 	
	Метод = "/api/v1/import/items";
	
	СериализацияСтруктурыВCURL_Запрос = ПолучитьТелоКакJSON(ДанныеДляAPI);
	
	НовыйЗапросHTTP = ПодготовитьHTTPЗапрос(СериализацияСтруктурыВCURL_Запрос, Метод); 
	
	Попытка
		Ответ = Соединение.ОтправитьДляОбработки(НовыйЗапросHTTP);
		Если Ответ.КодСостояния = 200 Тогда
			Сообщить("Товары успешно выгружены в API");
		Иначе
			Сообщить("Ошибка при выгрузке товаров: " + Ответ.КодСостояния);
		КонецЕсли;
		
	Исключение
		Сообщить("Ошибка соединения с API: " + ОписаниеОшибки());
	КонецПопытки;
	
	ВыгрузкаЦен(Оборудование, МоментПоследнейЗагрузки)
	
КонецПроцедуры

Функция ПодготовитьДанныеДляAPI(Оборудование, ПолнаяВыгрузка, ЭтоКлиент = Истина, МоментПоследнейЗагрузки, ВыгружатьГруппыПоКоду = Истина, ВыгружатьОстатки = Ложь) Экспорт

    // Получаем данные из существующей функции
    ДанныеТоваров = МенеджерОборудованияРарусСервер.ПолучитьТаблицуТоваров(
        Оборудование, 
        ПолнаяВыгрузка, 
        ЭтоКлиент, 
        МоментПоследнейЗагрузки, 
        ВыгружатьГруппыПоКоду, 
        ВыгружатьОстатки
    );
    
    // Подготавливаем структуру для API
    РезультатAPI = Новый Структура;
    РезультатAPI.Вставить("elements", Новый Массив);
	
	НомерСтроки = 0;
	Для Каждого Товар Из ДанныеТоваров Цикл
		 НомерСтроки = НомерСтроки + 1;
		 
		 Если Товар.Цена = Неопределено Тогда
			ПродолжитЬ;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Товар.ЕдиницаИзмерения) Тогда
			Продолжить;
		КонецЕсли;	
		
        ЭлементAPI = Новый Структура;
        
        // Основные поля товара
        ЭлементAPI.Вставить("id", Товар.Артикул);
        ЭлементAPI.Вставить("name", Товар.Наименование);
        ЭлементAPI.Вставить("itemGroup", Строка(Товар.Родитель.УникальныйИдентификатор()));
        ЭлементAPI.Вставить("measure", Товар.ЕдиницаИзмерения);
        ЭлементAPI.Вставить("descr", ""); // Зарезервировано
        ЭлементAPI.Вставить("delete", Ложь);
        
        // Определяем точность измерения
        Если Товар.ЭтоВесовой Тогда
            ЭлементAPI.Вставить("measprec", 3); // Весовой товар
        Иначе
            ЭлементAPI.Вставить("measprec", 0); // Штучный товар
        КонецЕсли;
        
        // Налоговая группа (преобразуем ставку НДС)
        ЭлементAPI.Вставить("taxgroupId", ПолучитьКодНалоговойГруппы(Товар.СтавкаНДСУКМ5));
        
        // Атрибуты товара
        Атрибуты = Новый Массив;
        Атрибуты = ПолучитьАтрибутыТовара(Товар);
        ЭлементAPI.Вставить("attributes", Атрибуты);
        
        // Штрихкоды
        ШтрихкодыAPI = Новый Массив;
        Если Товар.Штрихкоды <> Неопределено Тогда
            Для Каждого Штрихкод Из Товар.Штрихкоды Цикл
                ШтрихкодAPI = Новый Структура;
                ШтрихкодAPI.Вставить("id", Штрихкод.Штрихкод);
                ШтрихкодAPI.Вставить("quantity", Штрихкод.Кратность);
                ШтрихкодыAPI.Добавить(ШтрихкодAPI);
            КонецЦикла;
        КонецЕсли;
        ЭлементAPI.Вставить("barcodes", ШтрихкодыAPI);
        
        РезультатAPI.elements.Добавить(ЭлементAPI);
		
		//Попытка 
		//	ПолучитьТелоКакJSON(РезультатAPI)
		//Исключение
		//	Сообщить("Ошибка в структуре в строке -" + НомерСтроки);
		//КонецПопытки;
		
    КонецЦикла;
    
    Возврат РезультатAPI;

КонецФункции

Функция ПолучитьКодНалоговойГруппы(СтавкаНДС)
    
	Если СтавкаНДС = "none" Тогда
		Возврат 0; // Без НДС
	Иначе
		Возврат СтавкаНДС;
	КонецЕсли;

КонецФункции

Функция ПолучитьАтрибутыТовара(Товар)
    
	Атрибуты = Новый Массив;
	
	ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры;
	
	Если Товар.ОсобенностьУчета = ОсобенностьУчета.Товар Тогда
		Возврат Атрибуты;
	КонецЕсли;
	
	Если Товар.ОсобенностьУчета = ОсобенностьУчета.ПустаяСсылка() Тогда
		Возврат Атрибуты;
	КонецЕсли;
	
	Если Товар.ОсобенностьУчета = ОсобенностьУчета.АлкогольМаркированный Тогда
		
		АтрибутАлкоголь = Новый Структура;
		АтрибутАлкоголь.Вставить("id", "alcohol");
		Атрибуты.Добавить(АтрибутАлкоголь);
		
		АтрибутEgais = Новый Структура;
		АтрибутEgais.Вставить("id", "egais");
		Атрибуты.Добавить(АтрибутEgais);
		
	КонецЕсли;
	
	Если Товар.ОсобенностьУчета = ОсобенностьУчета.АлкогольНеМаркированный Тогда
		АтрибутАлкоголь = Новый Структура;
		АтрибутАлкоголь.Вставить("id", "alcohol");
		Атрибуты.Добавить(АтрибутАлкоголь);
	КонецЕсли;
	
	Если Товар.ОсобенностьУчета = ОсобенностьУчета.ТабакМаркированный Тогда
		
		АтрибутТабак = Новый Структура;
		АтрибутТабак.Вставить("id", "tobacco");
		Атрибуты.Добавить(АтрибутТабак);
		
		АтрибутМаркировкаТабак = Новый Структура;
		АтрибутМаркировкаТабак.Вставить("id", "markedTobacco");
		Атрибуты.Добавить(АтрибутМаркировкаТабак);
		
	КонецЕсли;
	
	Если Товар.ОсобенностьУчета = ОсобенностьУчета.ТабакНеМаркированный Тогда
		АтрибутТабак = Новый Структура;
		АтрибутТабак.Вставить("id", "tobacco");
		Атрибуты.Добавить(АтрибутТабак);
	КонецЕсли;
	
	//Если Товар.ОсобенностьУчета = ОсобенностьУчета.МолочнаяПродукция
	//	ИЛИ  Товар.ОсобенностьУчета = ОсобенностьУчета.МолочнаяПродукцияБезВетИС
	//	ИЛИ  Товар.ОсобенностьУчета = ОсобенностьУчета.МолочнаяПродукцияВГотовомВидеМаркированная
	//	ИЛИ  Товар.ОсобенностьУчета = ОсобенностьУчета.МолочнаяПродукцияВГотовомВидеЧастичноМаркированная
	//	ИЛИ  Товар.ОсобенностьУчета = ОсобенностьУчета.МолочнаяПродукцияДляПродажиВНарезкуМаркированная Тогда
	//	АтрибутыМолочнойПродукции = Новый Структура;
	//	АтрибутыМолочнойПродукции.Вставить("id", "markedGoods");
	//	Атрибуты.Добавить(АтрибутыМолочнойПродукции);
	//КонецЕсли;
	
	Если Товар.ОсобенностьУчета.ТипМаркировки = 1 или Товар.ОсобенностьУчета.ТипМаркировки = 6 Тогда	
		АтрибутыМаркированнойПродукции = Новый Структура;
		АтрибутыМаркированнойПродукции.Вставить("id", "markedGoods");
		Атрибуты.Добавить(АтрибутыМаркированнойПродукции);
	КонецЕсли;
	
	
	//Если Товар.ОсобенностьУчета = ОсобенностьУчета.ВодаУпакованнаяМаркированная
	//	ИЛИ Товар.ОсобенностьУчета = ОсобенностьУчета.ВодаУпакованнаяЧастичноМаркированная Тогда
	//	
	//	АтрибутВоды = Новый Структура;
	//	АтрибутВоды.Вставить("id", "markedGoods");
	//	Атрибуты.Добавить(АтрибутВоды);
	//	
	//КонецЕсли;
	
	Если Товар.ОсобенностьУчета = ОсобенностьУчета.СахаросодержащиеНапиткиПодакцизные Тогда
		
		//АтрибутыСахСодержащейПродукции = Новый Структура;
		//АтрибутыСахСодержащейПродукции.Вставить("id", "markedGoods");
		//Атрибуты.Добавить(АтрибутыСахСодержащейПродукции);
		
		АтрибутEgais = Новый Структура;
		АтрибутEgais.Вставить("id", "egais");
		Атрибуты.Добавить(АтрибутEgais);
		
	КонецЕсли;
	
	Если Товар.ОсобенностьУчета = ОсобенностьУчета.Аванс Тогда
		//АтрибутАванс = Новый Структура;
		//АтрибутАванс.Вставить("id", "advance");
		//Атрибуты.Добавить(АтрибутАванс);
	КонецЕсли;
	
	Если Товар.ОсобенностьУчета = ОсобенностьУчета.Энергетик Тогда
		АтрибутЭнергетик = Новый Структура;
		АтрибутЭнергетик.Вставить("id", "energyDrink");
		Атрибуты.Добавить(АтрибутЭнергетик);
	КонецЕсли;
	
	Возврат Атрибуты;

КонецФункции

#КонецОбласти

#Область Выгрузка_Цен
  
Процедура ВыгрузкаЦен(пМагазин = Неопределено, МоментПоследнейВыгрузки) Экспорт
	  
	Соединение = ПолучитьПараметрыПодключения();   
	Метод = "/api/v1/import/groupItems";
	
	ДатаНачалаДействияЦены = Строка(Формат(НачалоДня(ТекущаяДата()), "ДФ=yyyy-MM-dd")) + "T" + Строка(Формат(НачалоДня(ТекущаяДата()),"ДФ=ЧЧ:мм:сс"));              
	ДатаОкончанияЦены = Строка(Формат(НачалоДня(Дата('2039,01,01')), "ДФ=yyyy-MM-dd")) + "T" + Строка(Формат(НачалоДня(Дата('2033,01,01')),"ДФ=ЧЧ:мм:сс"));  
	
	Если пМагазин  = Неопределено Тогда
		СписокМагазиновДляВыгрузки = СписокМагазинов();
	Иначе 
		СписокМагазиновДляВыгрузки = Новый Массив;
		СписокМагазиновДляВыгрузки.Добавить(пМагазин);
	КонецЕсли;
	
	Для Каждого Магазин ИЗ СписокМагазиновДляВыгрузки Цикл
		
		ДанныеТоваров = МенеджерОборудованияРарусСервер.ПолучитьТаблицуТоваров(Магазин, Истина, Ложь, МоментПоследнейВыгрузки);
		
		НомерМагазина = СтрЗаменить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Магазин, "ИндексМагазина"), Символы.НПП, ""); 
		
		Элементы = Новый Массив; 
		
		Для Каждого ВыборкаЦен ИЗ ДанныеТоваров Цикл
			ТекЦена = 0;
			Если Магазин.ОсновнойОтдел.ТипЦенРозничнойТорговли.Рассчитывается Тогда
				ТекНоменклатура = Справочники.Номенклатура.НайтиПоРеквизиту("Артикул",ВыборкаЦен.Артикул);
				Если (НЕ ТекНоменклатура.Пустая()) и (НЕ ТекНоменклатура.ЭтоГруппа) Тогда
					Попытка
						ТекЦена = ЦенообразованиеСервер.ПолучитьЦену(Магазин.ОсновнойОтдел.ТипЦенРозничнойТорговли, ТекНоменклатура,Текущаядата(),,,,,,Магазин.ОсновнойОтдел.ПодразделениеКомпании);
					Исключение
						ТекЦена = ВыборкаЦен.Цена;
					КонецПопытки;
				Иначе
					ТекЦена = ВыборкаЦен.Цена;
				КонецЕсли;
			Иначе	
				ТекЦена = ВыборкаЦен.Цена;
			КонецЕсли;
			
			Если ТекЦена  = Неопределено или ТекЦена = 0 тогда
				Продолжить;
			КонецЕсли;
			
			Элементы.Добавить(Новый Структура("itemId, isPromoPrice, minprice, price, dateTo, dateToFrom, delete",
			СокрЛП(ВыборкаЦен.Артикул),                       
			Ложь, //ВыборкаЦен.ПризнакАкционностиЦены,        
			ВыборкаЦен.МРЦ, //ВыборкаЦен.МинимальнаяЦена,               
			ТекЦена,   
			ДатаОкончанияЦены,						
			ДатаНачалаДействияЦены,                   
			Ложь,)); //ВыборкаЦен.ПризнакУдалененияЦены,));    
			
			
		КонецЦикла; 
		
		СтруктураЗапросаСпециальногоВида = Новый Структура("elements", Элементы);
		
		URL_Запрос = ПолучитьТелоКакJSON(СтруктураЗапросаСпециальногоВида); 
		
		Метод = "/api/v1/import/store/" + НомерМагазина + "/itemPrices"; 
		
		НовыйЗапросHTTP = ПодготовитьHTTPЗапрос(URL_Запрос, Метод); 
		
		Ответ = Соединение.ОтправитьДляОбработки(НовыйЗапросHTTP);
		ЗаполнениеИнформацииОВыгрузки(Элементы);
		Если Ответ.КодСостояния = 200 Тогда
			Сообщить(СтрШаблон("Выгрузка цен по магазину № %1 прошла успешно", Магазин));               
		Иначе
			Сообщить(СтрШаблон("Ошибка при выгрузки цен по магазину № %1, состояние %2",Магазин, Ответ.КодСостояния));
		КонецЕсли; 
		
	КонецЦикла; 
	  
КонецПроцедуры

#КонецОбласти

#Область Выгрузка_Кассиров

Процедура ВыгрузкаКассиров(МоментПоследнейЗагрузки, пМагазин = Неопределено, Знач УдалениеКассира = Ложь) Экспорт
 
	Элементы = Новый Массив; // Это корневая структура
	
	Соединение = ПолучитьПараметрыПодключения();
	
	Если пМагазин = Неопределено Тогда
		СписокМагазинов = СписокМагазинов();
	Иначе
		СписокМагазинов = Новый Массив;
		СписокМагазинов.Добавить(пМагазин);
	КонецЕсли;
	
	Для Каждого Магазин ИЗ СписокМагазинов Цикл
		
		ДанныеКассиров = МенеджерОборудованияРарусСервер.ПолучитьТаблицуПерсонала(Магазин, Ложь, МоментПоследнейЗагрузки);
		
		Для Каждого ВыборкаДанныхОКассирах Из ДанныеКассиров Цикл	
			
			НомерМагазина = СтрЗаменить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Магазин, "ИндексМагазина"), Символы.НПП, "");       
			
			МассивКарт = Новый Массив;
			МассивКарт.Добавить(Новый Структура("number, active", СтрЗаменить(ВыборкаДанныхОКассирах.Код, Символы.НПП, ""), Истина));
			
			Элементы.Добавить(Новый Структура("password, cards, roleId, name, id, delete",
			СтрЗаменить(ВыборкаДанныхОКассирах.ПарольКассира, Символы.НПП, ""),   
			МассивКарт,
			ВыборкаДанныхОКассирах.Должность,
			ВыборкаДанныхОКассирах.Наименование,
			ВыборкаДанныхОКассирах.Код,                              
			ВыборкаДанныхОКассирах.Удален));
			
			Метод = "/api/v1/import/store/" + НомерМагазина + "/users";
			
			ТелоЗапроса = Новый Структура("elements", Элементы);
			
			URL_Запрос = ПолучитьТелоКакJSON(ТелоЗапроса); 
			
			Запрос = ПодготовитьHTTPЗапрос(URL_Запрос, Метод);  
			Ответ  = Соединение.ОтправитьДляОбработки(Запрос); 
			
			//Сообщить(Ответ.КодСостояния);
			ЗаполнениеИнформацииОВыгрузки(Элементы);  
			
		КонецЦикла;	
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область ПикЛИсты

Процедура ВыгрузкаДанныхПоПикЛисту(Знач Магазин,МоментыПоследнейВыгрузки,ГруппаТоваровОборудования) Экспорт
	
	СписокМагазиновПикЛистов = Новый Массив;
	СписокМагазиновПикЛистов.Добавить(Новый Структура("id", СтрЗаменить(Строка(Магазин), Символ(160), "")));

	
	Соединение = ПолучитьПараметрыПодключения();   
	Метод = "/api/v1/import/picklists";
	
	ЗапросПикЛистов = Новый Запрос;     
	ЗапросПикЛистов.Текст = ТекстЗапросаДанныхПикЛиста();	
	ЗапросПикЛистов.УстановитьПараметр("МоментПоследнейВыгрузки",МоментыПоследнейВыгрузки);
	ЗапросПикЛистов.УстановитьПараметр("ГруппаТоваровВОборудовании",ГруппаТоваровОборудования);
	
	ВыборкаДанныхПикЛиста = ЗапросПикЛистов.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);;
	
	Пока ВыборкаДанныхПикЛиста.Следующий() Цикл
		
		Элементы = Новый Массив;
		
		СписокНоменклатуры = Новый Массив;
		ВыборкаНоменклатуры = ВыборкаДанныхПикЛиста.Выбрать();
		Пока ВыборкаНоменклатуры.Следующий() Цикл
			СписокНоменклатуры.Добавить(ВыборкаНоменклатуры.КодТовара);
		КонецЦикла;
		
		МассивРеквизитов = Новый Структура("stores, name, isGlobal, id, items, delete", 
		СписокМагазиновПикЛистов, 
		ВыборкаДанныхПикЛиста.НаименованиеПикЛиста, 
		ВыборкаДанныхПикЛиста.ДействуетВоВсех, 
		ВыборкаДанныхПикЛиста.ИдГруппы, 
		СписокНоменклатуры, 
		ВыборкаДанныхПикЛиста.ПризнакУдаления);   
		
		Элементы.Добавить(МассивРеквизитов);
		
		СтруктураЗапросаСпециальногоВида  = Новый Структура("elements", Элементы);
		URL_Запрос = ПолучитьТелоКакJSON(СтруктураЗапросаСпециальногоВида); 
		
		НовыйЗапросHTTP = ПодготовитьHTTPЗапрос(URL_Запрос, Метод); 
		
		Ответ = Соединение.ОтправитьДляОбработки(НовыйЗапросHTTP);
		
		Если Ответ.КодСостояния = 200 Тогда
			Сообщить(СтрШаблон("Выгрузка данных пик листа %1 прошла успешно", ВыборкаДанныхПикЛиста.НаименованиеПикЛиста));               
		Иначе
			Сообщить(СтрШаблон("ошибка при выгрузке данных пик листу %1", ВыборкаДанныхПикЛиста.НаименованиеПикЛиста));
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаДанныхПикЛиста()

	Возврат "ВЫБРАТЬ
	        |	итГруппыКСОНоменклатурыСрезПоследних.Номенклатура КАК Номенклатура,
	        |	итГруппыКСОНоменклатурыСрезПоследних.ГруппаКСО КАК ГруппаКСО
	        |ПОМЕСТИТЬ НоменклатураПоПикЛИстам
	        |ИЗ
	        |	РегистрСведений.итГруппыКСОНоменклатуры.СрезПоследних(, Период > &МоментПоследнейВыгрузки) КАК итГруппыКСОНоменклатурыСрезПоследних
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТоварыВОборудовании КАК ТоварыВОборудовании
	        |		ПО (итГруппыКСОНоменклатурыСрезПоследних.Номенклатура = ТоварыВОборудовании.Номенклатура
	        |				И ТоварыВОборудовании.ГруппаТоваров = &ГруппаТоваровВОборудовании)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	итГруппыНоменклатурыКСО.Наименование КАК НаименованиеПикЛиста,
	        |	ИСТИНА КАК ДействуетВоВсех,
	        |	итГруппыНоменклатурыКСО.ИДГруппы КАК ИдГруппы,
	        |	итГруппыНоменклатурыКСО.ПометкаУдаления КАК ПризнакУдаления,
	        |	спрНоменклатура.Артикул КАК КодТовара
	        |ИЗ
	        |	НоменклатураПоПикЛИстам КАК НоменклатураПоПикЛИстам
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.итГруппыНоменклатурыКСО КАК итГруппыНоменклатурыКСО
	        |		ПО НоменклатураПоПикЛИстам.ГруппаКСО = итГруппыНоменклатурыКСО.Ссылка
	        |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК спрНоменклатура
	        |		ПО НоменклатураПоПикЛИстам.Номенклатура = спрНоменклатура.Ссылка
	        |
	        |УПОРЯДОЧИТЬ ПО
	        |	ИдГруппы
	        |ИТОГИ
	        |	МАКСИМУМ(НаименованиеПикЛиста),
	        |	МАКСИМУМ(ДействуетВоВсех),
	        |	МАКСИМУМ(ПризнакУдаления)
	        |ПО
	        |	ИдГруппы";
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область ЗагрузкаУКМ5

#Область Загрузка_Чеков_ККМ

Процедура ЗагрузитьЧекиККМ(Оборудование = Неопределено, ДатаЗагрузкиДанных = Неопределено, Успешно = Истина, ТекстОшибки = "", Касса = Неопределено) Экспорт
	
	Если ДатаЗагрузкиДанных = Неопределено Тогда 
		ДатаЗагрузкиДанных = ТекущаяДата();
	КонецЕсли;		
	
	Если Оборудование = Неопределено Тогда
		СписокМагазинов = СписокМагазинов();
	Иначе
		СписокМагазинов = Новый Массив;
		СписокМагазинов.Добавить(Оборудование);
	КонецЕсли;
	
	Соединение = ПолучитьПараметрыПодключения(Ложь);
	
	ДатаЗагрузки = Строка(Формат(?(ЗначениеЗаполнено(ДатаЗагрузкиДанных), ДатаЗагрузкиДанных, ТекущаяДата()), "ДФ=yyyy-MM-dd"));
	
	ИнтервалВыгрузки = (КонецДня(ТекущаяДата()) - КонецДня(ДатаЗагрузкиДанных) + 86400) / (60*60*24);
	
	Индекс = 0;
	
	Пока Индекс < ИнтервалВыгрузки Цикл
		
		ДатаЗагрузки = КонецДня(ДатаЗагрузкиДанных + ?(Индекс = 0, 0, Индекс*86400)); 
		Дата = Строка(Формат(ДатаЗагрузки, "ДФ=yyyy-MM-dd"));
		Индекс = Индекс +1;
		
		Для Каждого Магазин ИЗ СписокМагазинов Цикл
			
			Попытка
				
				ИдМагазина = СтрЗаменить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Магазин, "ИндексМагазина"), Символы.НПП, "");
				
				АдресРесурса = "/api/v1/export/receipt/" +  СтрЗаменить(ИдМагазина, Символ(160), "") + "/" + Дата;   
				
				НовыйЗапросHTTP = Новый HTTPЗапрос(АдресРесурса);
				
				РезультатВыполненияЗапроса = Соединение.Получить(НовыйЗапросHTTP);
				Если РезультатВыполненияЗапроса.КодСостояния = 200 Тогда 
					
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(РезультатВыполненияЗапроса.ПолучитьТелоКакСтроку());
					ДанныеОтвета = ПрочитатьJSON(ЧтениеJSON, Ложь);
					НачатьТранзакцию();
					Попытка
						ОбработатьДанныеИзAPI(ДанныеОтвета, Оборудование, Ложь, "", Касса); 
						ЗафиксироватьТранзакцию();
					Исключение
						ОтменитьТранзакцию();
						ТекстОшибки = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						Успешно = Ложь;
						ВызватьИсключение;
					КонецПопытки;
				КонецЕсли;  
				
			Исключение
				Ошибка = ОписаниеОшибки();
				Сообщить(Ошибка);
				ТекстОшибки = Ошибка;
				Успешно = ложь;
			КонецПопытки;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаМагазиновДляЗагрузкиЧеков()

		Возврат "ВЫБРАТЬ
		        |	Склады.Ссылка КАК Магазин
		        |ИЗ
		        |	Справочник.СкладыКомпании КАК Склады
		        |ГДЕ
		        |	Склады.Ссылка В(&СписокМагазинов)";
	
КонецФункции

Процедура ОбработатьДанныеИзAPI(ДанныеИзAPI, ОфлайнОборудование, Отказ, ТекстОшибки, Касса = Неопределено)

	ТаблицаКассККМ = ОфлайнОборудованиеPOSСуперМАГВызовСервера.ПолучитьКассыККМ(ОфлайнОборудование);
	
	Для Каждого ЧекAPI Из ДанныеИзAPI.elements Цикл
		
		Если НЕ Касса = Неопределено И НЕ ЧекAPI.posId = Касса Тогда
			Продолжить;
		КонецЕсли;
		
		//Если НЕ Нрег(ЧекAPI.receiptType) = "sale" Тогда
		//	Продолжить;
		//КонецЕсли;
		
		НомерКассы   = ЧекAPI.posId;
		ИдСмены      = ЧекAPI.shiftId;
		НомерСмены   = ЧекAPI.shiftNumber;
		НомерЧека    = ЧекAPI.number;
		НомерДок     = ЧекAPI.globalDocNumber;
		ДатаЧека     = ПрочитатьДатуJSON(ЧекAPI.dates.dateClose, ФорматДатыJSON.ISO); // или dateOpen?
		Кассир       = ?(ЗначениеЗаполнено(ЧекAPI.cashierId), ЧекAPI.cashierId, 0);
		//ТипЧека      = ОпределитьТипЧекаПоТипуAPI(ЧекAPI.receiptType);  sale
		
		Если ЧекAPI.receiptType = "Sale" Тогда
			ТипЧека = 0;
		Иначе
			ТипЧека = 1;
		КонецЕсли;
	
		НомерКарты   = "1"; //?(ЗначениеЗаполнено(ЧекAPI.additional?.client?.cardNumber), ЧекAPI.additional.client.cardNumber, "");

		ЧекЗавершенУспешно = ЧекAPI.result = "Completed";
		
		СтрокаКассыККМ = ТаблицаКассККМ.Найти(НомерКассы, "НомерКассы");
		Если СтрокаКассыККМ = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		ЧекСоздан = ПроверитьСозданныйЧек(СтрокаКассыККМ.ССылка, ДатаЧека, НомерДок, НомерЧека, НомерСмены,ЧекЗавершенУспешно,ТипЧека);
		Если ЧекСоздан Тогда
			Продолжить;
		КонецЕсли;	
		
		Если НЕ ЧекЗавершенУспешно Тогда 
			 Продолжить;
		КонецЕсли;	
			
		ТаблицыПродаж = Новый Структура;
		
		// Создаём таблицы
		ТаблицаСмен          = Новый ТаблицаЗначений;
		ТаблицаЧеков         = Новый ТаблицаЗначений;
		ТаблицаПродаж        = Новый ТаблицаЗначений;
		ТаблицаОплат         = Новый ТаблицаЗначений;
		ТаблицаМарок         = Новый ТаблицаЗначений;
		ТаблицаСкидокПоКарте = Новый ТаблицаЗначений; // не используется
		
		// Колонки таблицы смен (минимум для связи)
		ТаблицаСмен.Колонки.Добавить("НомерКассы");
		ТаблицаСмен.Колонки.Добавить("ИдСмены");
		ТаблицаСмен.Колонки.Добавить("НомерСмены");
		ТаблицаСмен.Колонки.Добавить("КассирЗакрыл"); // может не использоваться
		
		// Колонки таблицы чеков
		ТаблицаЧеков.Колонки.Добавить("НомерКассы");
		ТаблицаЧеков.Колонки.Добавить("ИдСмены");
		ТаблицаЧеков.Колонки.Добавить("НомерСмены");
		ТаблицаЧеков.Колонки.Добавить("НомерЧека");
		ТаблицаЧеков.Колонки.Добавить("НомерДокумента");
		ТаблицаЧеков.Колонки.Добавить("ДатаЧека");
		ТаблицаЧеков.Колонки.Добавить("Кассир");
		ТаблицаЧеков.Колонки.Добавить("ТипЧека");
		ТаблицаЧеков.Колонки.Добавить("НомерКартыКлиента");
		
		// Колонки таблицы продаж
		ТаблицаПродаж.Колонки.Добавить("НомерКассы");
		ТаблицаПродаж.Колонки.Добавить("ИдСмены");
		ТаблицаПродаж.Колонки.Добавить("НомерЧека");
		ТаблицаПродаж.Колонки.Добавить("Артикул");
		ТаблицаПродаж.Колонки.Добавить("Количество");
		ТаблицаПродаж.Колонки.Добавить("Цена");
		ТаблицаПродаж.Колонки.Добавить("СтавкаНДС");
		ТаблицаПродаж.Колонки.Добавить("СуммаВсего");
		ТаблицаПродаж.Колонки.Добавить("СуммаСкидки");
		ТаблицаПродаж.Колонки.Добавить("Скидка");
		ТаблицаПродаж.Колонки.Добавить("ПорядокСкидки");
		ТаблицаПродаж.Колонки.Добавить("ИДСтроки");
		ТаблицаПродаж.Колонки.Добавить("Единица");
		
		// Колонки таблицы оплат
		ТаблицаОплат.Колонки.Добавить("НомерКассы");
		ТаблицаОплат.Колонки.Добавить("ИдСмены");
		ТаблицаОплат.Колонки.Добавить("НомерЧека");
		ТаблицаОплат.Колонки.Добавить("СуммаПлатежа");
		ТаблицаОплат.Колонки.Добавить("ИДУстройства");
		ТаблицаОплат.Колонки.Добавить("НомерКарты");
		
		// Колонки таблицы марок
		ТаблицаМарок.Колонки.Добавить("GTIN");
		ТаблицаМарок.Колонки.Добавить("Марка");
		ТаблицаМарок.Колонки.Добавить("Артикул");		
		
				
		СтрокаСмены = ТаблицаСмен.Добавить();
		СтрокаСмены.НомерКассы   = НомерКассы;
		СтрокаСмены.ИдСмены      = ИдСмены;
		СтрокаСмены.НомерСмены   = НомерСмены;
		СтрокаСмены.КассирЗакрыл = Кассир;
		
		// Добавляем чек
		СтрокаЧека = ТаблицаЧеков.Добавить();
		СтрокаЧека.НомерКассы        = НомерКассы;
		СтрокаЧека.ИдСмены           = ИдСмены;
		СтрокаЧека.НомерСмены        = НомерСмены;
		СтрокаЧека.НомерЧека         = НомерЧека;
		СтрокаЧека.НомерДокумента    = НомерДок;
		СтрокаЧека.ДатаЧека          = ДатаЧека;
		СтрокаЧека.Кассир            = Кассир;
		СтрокаЧека.ТипЧека           = ТипЧека;
		СтрокаЧека.НомерКартыКлиента = НомерКарты;
		
		// Добавляем позиции
		ИДСтроки = 1;
		Для Каждого Позиция Из ЧекAPI.items Цикл
			
			Артикул = ?(ЗначениеЗаполнено(Позиция.productInfo.scu), Позиция.productInfo.scu, Позиция.productInfo.barcode);
			
			// Определяем ставку НДС
			СтавкаНДС = 0;
			//Если Позиция.taxes И Позиция.taxes.Количество() > 0 Тогда
			//	СтавкаНДС = Позиция.taxes[0].percent;
			//КонецЕсли;
			СтавкаНДС = Позиция.productInfo.taxGroup;
			// Скидка
			ИдентификаторСкидки = "";
			Если Позиция.discounts.Количество() > 0 Тогда
				ИдентификаторСкидки = Строка(Позиция.discounts[0].id);
			КонецЕсли;
			
			СтрокаПродажи = ТаблицаПродаж.Добавить();
			СтрокаПродажи.НомерКассы     = НомерКассы;
			СтрокаПродажи.ИдСмены        = ИдСмены;
			СтрокаПродажи.НомерЧека      = НомерЧека;
			СтрокаПродажи.Артикул        = Артикул;
			СтрокаПродажи.Количество     = Позиция.totalQuantity.amount;
			СтрокаПродажи.Цена           = Позиция.price.amount;
			СтрокаПродажи.СтавкаНДС      = СтавкаНДС;
			
			Если ТипЧека = 1 ТОгда
				СтрокаПродажи.СуммаВсего     = Позиция.totalAmount.amount;
			Иначе
				СтрокаПродажи.СуммаВсего     = Позиция.totalWithDiscounts.amount;
			КонецЕсли;
			
			СтрокаПродажи.СуммаСкидки    = ?(ЗначениеЗаполнено(Позиция.discountAmount), Позиция.discountAmount.amount, 0);
			СтрокаПродажи.Скидка         = ИдентификаторСкидки;
			СтрокаПродажи.ПорядокСкидки  = 0; // можно уточнить логику
			СтрокаПродажи.ИДСтроки       = ИДСтроки;
			СтрокаПродажи.Единица        = Позиция.productInfo.measure;
			
			// Маркировка (если есть)
			Если Позиция.свойство("kiz") Тогда
				СтрокаМарки = ТаблицаМарок.Добавить();
				СтрокаМарки.GTIN  = ?(ЗначениеЗаполнено(Позиция.productInfo.scu), Позиция.productInfo.scu, "");
				СтрокаМарки.Марка = Позиция.kiz.kktKIZ.serial;
				СтрокаМарки.Артикул = Артикул;
			КонецЕсли;
			
			ИДСтроки = ИДСтроки + 1;
		КонецЦикла;
		
		Для Каждого Оплата Из ЧекAPI.payments Цикл
			СтрокаОплаты = ТаблицаОплат.Добавить();
			СтрокаОплаты.НомерКассы      = НомерКассы;
			СтрокаОплаты.ИдСмены         = ИдСмены;
			СтрокаОплаты.НомерЧека       = НомерДок; // В оригинале — номер документа!
			СтрокаОплаты.СуммаПлатежа    = Оплата.amount.amount;
			СтрокаОплаты.ИДУстройства    = ?(НРег(Оплата.pType) = "cash", 0, 1);
			СтрокаОплаты.НомерКарты      = ?(Оплата.Свойство("cardNumber"), ?(Оплата.name = "Оплата СКУД","ФР0000157",Оплата.cardNumber), ""); 
		КонецЦикла;
		
		ТаблицаСмен.Сортировать("НомерКассы, ИдСмены");
		ТаблицаЧеков.Сортировать("НомерКассы, ИдСмены, НомерЧека");
		ТаблицаПродаж.Сортировать("НомерКассы, ИдСмены, НомерЧека");
		ТаблицаОплат.Сортировать("НомерКассы, ИдСмены, НомерЧека");
		
		ТаблицыПродаж.Вставить("ТаблицаСмен", ТаблицаСмен);
		ТаблицыПродаж.Вставить("ТаблицаЧеков", ТаблицаЧеков);
		ТаблицыПродаж.Вставить("ТаблицаПродаж", ТаблицаПродаж);
		ТаблицыПродаж.Вставить("ТаблицаОплат", ТаблицаОплат);
		ТаблицыПродаж.Вставить("ТаблицаМарок", ТаблицаМарок);
		ТаблицыПродаж.Вставить("ТаблицаСкидокПоКарте", ТаблицаСкидокПоКарте);

		ДиапазоныЧеков = Новый Массив;
		ОфлайнОборудованиеPOSСуперМАГВызовСервера.ПриЗагрузкеЧеков(ТаблицыПродаж, ОфлайнОборудование, ДиапазоныЧеков, Отказ, ТекстОшибки);
		
	КонецЦикла;

КонецПроцедуры

Функция ПроверитьСозданныйЧек(КассаККМ, ДатаЧека, НомерДокумента, НомерЧека, НомерСмены,ЧекЗавершенУспешно,ТипЧека)

	ЧекСоздан = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Чек.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.Чек КАК Чек
	               |ГДЕ
	               |	Чек.НомерСмены = &НомерСмены
	               |	И Чек.НомерЧека = &НомерЧека
	               |	И Чек.НомерДокумента = &НомерДокумента
	               |	И Чек.ДатаФР = &ДатаФР
	               |	И Чек.КассаККМ = &КассаККМ
	               |	И НЕ Чек.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("НомерСмены",     НомерСмены);
	Запрос.УстановитьПараметр("НомерЧека",      НомерЧека);
	Запрос.УстановитьПараметр("НомерДокумента", НомерДокумента);
	Запрос.УстановитьПараметр("ДатаФР",         ДатаЧека);
	Запрос.УстановитьПараметр("КассаККМ",       КассаККМ);
	
	РезультатЗапроса = Запрос.Выполнить();
	ЧекСоздан = НЕ РезультатЗапроса.Пустой();
	
	Если ЧекСоздан и НЕ ЧекЗавершенУспешно Тогда
		РезультатЗапросаВыборка = РезультатЗапроса.Выбрать();
		Если РезультатЗапросаВыборка.Следующий() Тогда
			ТекЧекОбъект = РезультатЗапросаВыборка.Ссылка.ПолучитьОбъект();
			ТекЧекОбъект = Документы.Чек.НайтиПоНомеру("").ПолучитьОбъект();
			Если ТекЧекОбъект.Проведен Тогда
				ТекЧекОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
			КонецЕсли;
			
			ТекЧекОбъект.УстановитьПометкуУдаления(Истина);
			
		КонецЕсли; 
	ИначеЕсли ЧекСоздан Тогда
		РезультатЗапросаВыборка = РезультатЗапроса.Выбрать();
		Если РезультатЗапросаВыборка.Следующий() Тогда
			Если (НЕ РезультатЗапросаВыборка.Ссылка.ХозОперация = Справочники.ХозОперации.Чек) и ТипЧека = 0 Тогда
				ТекЧекОбъект = РезультатЗапросаВыборка.Ссылка.ПолучитьОбъект();
				ТекЧекОбъект.ХозОперация = Справочники.ХозОперации.Чек;
				ТекЧекОбъект.Записать();
			КонецЕсли;	
		КонецЕсли;
	КонецЕсли;	
	
	Возврат ЧекСоздан;
	
КонецФункции 

#КонецОбласти

#Область Загрузка_ОРП

Процедура ЗагрузкаОРП(Оборудование = Неопределено, Касса = Неопределено, ДатаЗагрузкиДанных = Неопределено, Успешно = Истина, ТекстОшибки = "") Экспорт
	
	Если ДатаЗагрузкиДанных = Неопределено Тогда 
		ДатаЗагрузкиДанных = ТекущаяДата();
	КонецЕсли;
	
	Соединение = ПолучитьПараметрыПодключения(Ложь);
	
	ДатаЗагрузки = Строка(Формат(?(ЗначениеЗаполнено(ДатаЗагрузкиДанных), ДатаЗагрузкиДанных, ТекущаяДата()), "ДФ=yyyy-MM-dd"));
	
	Если Оборудование = Неопределено Тогда
		СписокМагазиновДляВыгрузки = СписокМагазинов();
	Иначе
		СписокМагазиновДляВыгрузки = Новый Массив;
		СписокМагазиновДляВыгрузки.Добавить(Оборудование);
	КонецЕсли;
	
	ДатаЗагрузки = Строка(Формат(?(ЗначениеЗаполнено(ДатаЗагрузкиДанных), ДатаЗагрузкиДанных, ТекущаяДата()), "ДФ=yyyy-MM-dd"));
	
	ИнтервалВыгрузки = (КонецДня(ТекущаяДата()) - КонецДня(ДатаЗагрузкиДанных) + 86400) / (60*60*24);
	
	Индекс = 0;
	
	Пока Индекс < ИнтервалВыгрузки Цикл
		
		ДатаЗагрузки = КонецДня(ДатаЗагрузкиДанных + ?(Индекс = 0, 0, Индекс*86400)); 
		Дата = Строка(Формат(ДатаЗагрузки, "ДФ=yyyy-MM-dd"));
		Индекс = Индекс +1;
		
		Для Каждого Магазин ИЗ СписокМагазиновДляВыгрузки Цикл
			
			Попытка
				
				ИдМагазина = СтрЗаменить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Магазин, "ИндексМагазина"), Символы.НПП, "");
				
				АдресРесурса = "/api/v1/export/shift/" + ИдМагазина + "/" + СтрЗаменить(Касса, Символ(160), "") + "/" + Дата;
				
				НовыйЗапросHTTP = ПодготовитьHTTPЗапрос(, АдресРесурса); 
				
				Ответ = Соединение.Получить(НовыйЗапросHTTP);
				Если Ответ.КодСостояния = 200 Тогда 
					
					ЧтениеJSON = Новый ЧтениеJSON;
					ЧтениеJSON.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
					ДанныеОтвета = ПрочитатьJSON(ЧтениеJSON, Ложь);
					
					ОбработатьДанныеСменыИзAPI(ДанныеОтвета, Оборудование);
					
					ЗагрузкаОперацийСДЯ(Касса, Магазин, ДатаЗагрузки);
					
				КонецЕсли; 
				
			Исключение
				Успешно = Ложь;
				Ошибка = ОписаниеОшибки();
				ТекстОшибки = СТрШаблоН("Ошибка при формирование ОРП по магазину %1, текст ошибки: %2", "3", Ошибка);
			КонецПопытки;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОбработатьДанныеСменыИзAPI(ДанныеАПИ, Оборудование) Экспорт
	
	Для Каждого ЭлементСмены Из ДанныеАПИ.elements Цикл
		
		Отказ = Ложь;
		ТекстОшибки = "";
		
		ТаблицыПродаж = Новый Структура;
		
		// === 1. ТаблицаСмен ===
		ТаблицаСмен = Новый ТаблицаЗначений;
		ТаблицаСмен.Колонки.Добавить("НомерКассы",            Новый ОписаниеТипов("Число"));
		ТаблицаСмен.Колонки.Добавить("ИдСмены",              Новый ОписаниеТипов("Число"));
		ТаблицаСмен.Колонки.Добавить("НомерСмены",           Новый ОписаниеТипов("Число"));
		ТаблицаСмен.Колонки.Добавить("ДатаОткрытияСмены",    Новый ОписаниеТипов("Дата"));
		ТаблицаСмен.Колонки.Добавить("ДатаЗакрытияСмены",    Новый ОписаниеТипов("Дата"));
		ТаблицаСмен.Колонки.Добавить("КассирЗакрыл",         Новый ОписаниеТипов("Строка"));
		
		// === 2. Сводные таблицы ===
		ТаблицаСводныхПродаж        = Новый ТаблицаЗначений;
		ТаблицаСводныхОплат         = Новый ТаблицаЗначений;
		ТаблицаСводныхСкидок        = Новый ТаблицаЗначений;
		ТаблицаСводныхВозвратов     = Новый ТаблицаЗначений;
		ТаблицаСводныхВозвратовОплат = Новый ТаблицаЗначений;
		
		ТаблицаСводныхПродаж.Колонки.Добавить("НомерКассы",      Новый ОписаниеТипов("Число"));
		ТаблицаСводныхПродаж.Колонки.Добавить("ИдСмены",        Новый ОписаниеТипов("Число"));
		ТаблицаСводныхПродаж.Колонки.Добавить("Артикул",        Новый ОписаниеТипов("Строка"));
		ТаблицаСводныхПродаж.Колонки.Добавить("Количество",     Новый ОписаниеТипов("Число"));
		ТаблицаСводныхПродаж.Колонки.Добавить("Цена",           Новый ОписаниеТипов("Число"));
		ТаблицаСводныхПродаж.Колонки.Добавить("Сумма",          Новый ОписаниеТипов("Число"));
		ТаблицаСводныхПродаж.Колонки.Добавить("СуммаСкидки",    Новый ОписаниеТипов("Число"));
		ТаблицаСводныхПродаж.Колонки.Добавить("СуммаВсего",     Новый ОписаниеТипов("Число"));
		ТаблицаСводныхПродаж.Колонки.Добавить("СтавкаНДС",      Новый ОписаниеТипов("Число"));
		ТаблицаСводныхПродаж.Колонки.Добавить("КоличествоЧеков", Новый ОписаниеТипов("Число"));
		ТаблицаСводныхПродаж.Колонки.Добавить("КоличествоВозврат", Новый ОписаниеТипов("Число"));
		
		// Оплаты
		ТаблицаСводныхОплат.Колонки.Добавить("НомерКассы",       Новый ОписаниеТипов("Число"));
		ТаблицаСводныхОплат.Колонки.Добавить("ИдСмены",         Новый ОписаниеТипов("Число"));
		ТаблицаСводныхОплат.Колонки.Добавить("НомерКарты",      Новый ОписаниеТипов("Строка"));
		ТаблицаСводныхОплат.Колонки.Добавить("ИДУстройства",    Новый ОписаниеТипов("Число"));
		ТаблицаСводныхОплат.Колонки.Добавить("СуммаПлатежа",    Новый ОписаниеТипов("Число"));
		ТаблицаСводныхОплат.Колонки.Добавить("СуммаПлатежаВозврат", Новый ОписаниеТипов("Число"));
		ТаблицаСводныхОплат.Колонки.Добавить("КоличествоЧеков",  Новый ОписаниеТипов("Число"));
		
		// Скидки
		ТаблицаСводныхСкидок.Колонки.Добавить("НомерКассы",     Новый ОписаниеТипов("Число"));
		ТаблицаСводныхСкидок.Колонки.Добавить("ИдСмены",       Новый ОписаниеТипов("Число"));
		ТаблицаСводныхСкидок.Колонки.Добавить("Скидка",        Новый ОписаниеТипов("Строка"));
		ТаблицаСводныхСкидок.Колонки.Добавить("СуммаВсего",    Новый ОписаниеТипов("Число"));
		ТаблицаСводныхСкидок.Колонки.Добавить("СуммаСкидки",   Новый ОписаниеТипов("Число"));
		ТаблицаСводныхСкидок.Колонки.Добавить("КоличествоЧеков", Новый ОписаниеТипов("Число"));
		
		// Возвраты (товары)
		ТаблицаСводныхВозвратов.Колонки.Добавить("НомерКассы",      Новый ОписаниеТипов("Число"));
		ТаблицаСводныхВозвратов.Колонки.Добавить("ИдСмены",        Новый ОписаниеТипов("Число"));
		ТаблицаСводныхВозвратов.Колонки.Добавить("Артикул",        Новый ОписаниеТипов("Строка"));
		ТаблицаСводныхВозвратов.Колонки.Добавить("Количество",     Новый ОписаниеТипов("Число"));
		ТаблицаСводныхВозвратов.Колонки.Добавить("Цена",           Новый ОписаниеТипов("Число"));
		ТаблицаСводныхВозвратов.Колонки.Добавить("Сумма",          Новый ОписаниеТипов("Число"));
		ТаблицаСводныхВозвратов.Колонки.Добавить("СуммаСкидки",    Новый ОписаниеТипов("Число"));
		ТаблицаСводныхВозвратов.Колонки.Добавить("СуммаВсего",     Новый ОписаниеТипов("Число"));
		ТаблицаСводныхВозвратов.Колонки.Добавить("СтавкаНДС",      Новый ОписаниеТипов("Число"));
		ТаблицаСводныхВозвратов.Колонки.Добавить("КоличествоЧеков", Новый ОписаниеТипов("Число"));
		
		// Возвраты (оплаты)
		ТаблицаСводныхВозвратовОплат.Колонки.Добавить("НомерКассы",       Новый ОписаниеТипов("Число"));
		ТаблицаСводныхВозвратовОплат.Колонки.Добавить("ИдСмены",         Новый ОписаниеТипов("Число"));
		ТаблицаСводныхВозвратовОплат.Колонки.Добавить("НомерКарты",      Новый ОписаниеТипов("Строка"));
		ТаблицаСводныхВозвратовОплат.Колонки.Добавить("ИДУстройства",    Новый ОписаниеТипов("Число"));
		ТаблицаСводныхВозвратовОплат.Колонки.Добавить("СуммаПлатежа",    Новый ОписаниеТипов("Число"));
		ТаблицаСводныхВозвратовОплат.Колонки.Добавить("КоличествоЧеков",  Новый ОписаниеТипов("Число"));
		
		СменаAPI = ЭлементСмены.shift;
		Счетчики = ЭлементСмены.counters;
		Платежи  = ЭлементСмены.payments;
		
		СтрокаСмены = ТаблицаСмен.Добавить();
		СтрокаСмены.НомерКассы        = СменаAPI.posId;
		СтрокаСмены.ИдСмены           = СменаAPI.id;
		СтрокаСмены.НомерСмены        = СменаAPI.number;
		СтрокаСмены.ДатаОткрытияСмены =  ПрочитатьДатуJSON(СменаAPI.dateOpen, ФорматДатыJSON.ISO);     
		СтрокаСмены.ДатаЗакрытияСмены = ?(ЗначениеЗаполнено(СменаAPI.dateClose),ПрочитатьДатуJSON(СменаAPI.dateClose, ФорматДатыJSON.ISO), ТекущаяДата());
		СтрокаСмены.КассирЗакрыл      = Строка(СменаAPI.userIdClose); // Код кассира из API
		
		// --- Собираем продажи и возвраты из чеков ---
		СуммаДокумента = 0;
		Для Каждого Чек Из ЭлементСмены.receipts Цикл
			
			Если НРег(Чек.result) = "canceled" Тогда
				Продолжить; // Пропускаем отменённые чеки
			КонецЕсли;
			
			ТипЧека = Чек.receiptType;
			ЭтоВозврат = (Нрег(ТипЧека) = "refundonreceipt");
			
			Для Каждого Позиция Из Чек.items Цикл
				
				Артикул = ?(ЗначениеЗаполнено(Позиция.productInfo.scu), Позиция.productInfo.scu, Позиция.barcode);
				
				Если ЭтоВозврат Тогда
					
					//Продолжить;
					
					СтрокаВозврата = ТаблицаСводныхВозвратов.Добавить();
					СтрокаВозврата.НомерКассы        = Чек.posId;
					СтрокаВозврата.ИдСмены          = Чек.shiftId;
					СтрокаВозврата.Артикул          = Артикул;
					СтрокаВозврата.Количество       = Позиция.totalQuantity.amount;
					СтрокаВозврата.Цена             = Позиция.price.amount;
					СтрокаВозврата.Сумма            = Позиция.totalAmount.amount;
					СтрокаВозврата.СуммаСкидки      = Позиция.discountAmount.amount;
					СтрокаВозврата.СуммаВсего       = 0;
					СтрокаВозврата.СтавкаНДС        = ПолучитьСтавкуНДСИзПроцента(Позиция.taxes); // см. ниже
					СтрокаВозврата.КоличествоЧеков  = 1;
					
					СтрокаПродажи = ТаблицаСводныхПродаж.Добавить();
					СтрокаПродажи.НомерКассы        = Чек.posId;
					СтрокаПродажи.ИдСмены          = Чек.shiftId;
					СтрокаПродажи.Артикул          = Артикул;
					СтрокаПродажи.Количество       = -Позиция.totalQuantity.amount;
					СтрокаПродажи.Цена             = Позиция.price.amount;
					СтрокаПродажи.Сумма            = -Позиция.totalAmount.amount;
					СтрокаПродажи.СуммаСкидки      = -Позиция.discountAmount.amount;
					СтрокаПродажи.СуммаВсего       = -Позиция.totalAmount.amount;
					СтрокаПродажи.СтавкаНДС        = ПолучитьСтавкуНДСИзПроцента(Позиция.taxes);
					СтрокаПродажи.КоличествоЧеков  = 0;
					СтрокаПродажи.КоличествоВозврат = 1;
					
					
				Иначе
					
					СтрокаПродажи = ТаблицаСводныхПродаж.Добавить();
					СтрокаПродажи.НомерКассы        = Чек.posId;
					СтрокаПродажи.ИдСмены          = Чек.shiftId;
					СтрокаПродажи.Артикул          = Артикул;
					СтрокаПродажи.Количество       = Позиция.totalQuantity.amount;
					СтрокаПродажи.Цена             = Позиция.price.amount;
					СтрокаПродажи.Сумма            = Позиция.totalAmount.amount;
					СтрокаПродажи.СуммаСкидки      = Позиция.discountAmount.amount;
					СтрокаПродажи.СуммаВсего       = Позиция.totalWithDiscounts.amount;
					СтрокаПродажи.СтавкаНДС        = ПолучитьСтавкуНДСИзПроцента(Позиция.taxes);
					СтрокаПродажи.КоличествоЧеков  = 1;
					СтрокаПродажи.КоличествоВозврат = 0;
					
				КонецЕсли;
				
			КонецЦикла;
			
			// --- Оплаты ---
			Для Каждого Платёж Из Чек.payments Цикл
				
				СтрокаОплаты = ?(ЭтоВозврат, ТаблицаСводныхВозвратовОплат, ТаблицаСводныхОплат).Добавить();
				СтрокаОплаты.НомерКассы       = Чек.posId;
				СтрокаОплаты.ИдСмены         = Чек.shiftId;
				СтрокаОплаты.НомерКарты      = ?(НРег(Платёж.pType) = "card", ?(Платёж.name = "Оплата СКУД","ФР0000157",Платёж.cardNumber), "");
				СтрокаОплаты.ИДУстройства    = ?(НРег(Платёж.pType) = "cash", 0, 1);
				СтрокаОплаты.СуммаПлатежа    = Платёж.amount.amount;
				СтрокаОплаты.КоличествоЧеков = 1;
				Если ЭтоВозврат Тогда
					СтрокаОплаты.СуммаПлатежа = -Платёж.amount.amount; // Возврат — отрицательная сумма
				Иначе
					СтрокаОплаты.СуммаПлатежаВозврат = 0;
				КонецЕсли;
				
			КонецЦикла;
			
			// --- Скидки (если есть) ---
			Для Каждого Скидка Из Чек.calculated.discounts Цикл
				
				СтрокаСкидки = ТаблицаСводныхСкидок.Добавить();
				СтрокаСкидки.НомерКассы      = Чек.posId;
				СтрокаСкидки.ИдСмены        = Чек.shiftId;
				СтрокаСкидки.Скидка         = Строка(Скидка.id);
				СтрокаСкидки.СуммаВсего     = Скидка.amount;
				СтрокаСкидки.СуммаСкидки    = Скидка.amount;
				СтрокаСкидки.КоличествоЧеков = 1;
				
			КонецЦикла;
			
		КонецЦикла;
		
					
		ТаблицаСводныхПродаж.Свернуть("НомерКассы,ИдСмены,Артикул,Цена,СтавкаНДС","Количество,Сумма,СуммаСкидки,СуммаВсего,КоличествоЧеков,КоличествоВозврат");	
		ТаблицаСводныхОплат.Свернуть("НомерКассы,ИдСмены,НомерКарты,ИДУстройства","СуммаПлатежа,КоличествоЧеков,СуммаПлатежаВозврат");		
		ТаблицаСводныхВозвратовОплат.Свернуть("НомерКассы,ИдСмены,НомерКарты,ИДУстройства","СуммаПлатежа,КоличествоЧеков");
		
		// Упаковываем в структуру
		ТаблицыПродаж.Вставить("ТаблицаСмен",                   ТаблицаСмен);
		ТаблицыПродаж.Вставить("ТаблицаСводныхПродаж",          ТаблицаСводныхПродаж);
		ТаблицыПродаж.Вставить("ТаблицаСводныхОплат",           ТаблицаСводныхОплат);
		ТаблицыПродаж.Вставить("ТаблицаСводныхСкидок",          ТаблицаСводныхСкидок);
		ТаблицыПродаж.Вставить("ТаблицаСводныхВозвратов",       ТаблицаСводныхВозвратов);
		ТаблицыПродаж.Вставить("ТаблицаСводныхВозвратовОплат",  ТаблицаСводныхВозвратовОплат);
		
		// === Вызов стандартной логики ===
		ЗакрытыеСмены = Новый Массив;
		ДиапазоныЧеков = Новый Массив; // не используется в отчётах, но требуется по сигнатуре
		
		ОфлайнОборудованиеPOSСуперМАГВызовСервера.ПриЗагрузкеОтчетовОПродаже(ТаблицыПродаж, Оборудование, ЗакрытыеСмены, Отказ, ТекстОшибки);
		
		
	КонецЦикла;
	
КонецПроцедуры

// Вспомогательная функция: получает числовое значение ставки НДС из массива налогов
Функция ПолучитьСтавкуНДСИзПроцента(МассивНалогов) Экспорт
	Если МассивНалогов = Неопределено ИЛИ МассивНалогов.Количество() = 0 Тогда
		Возврат 0;
	КонецЕсли;
	// Берём первую ставку (в большинстве случаев она одна)
	Налог = МассивНалогов[0];
	Возврат Налог.taxGroupId;
КонецФункции


#КонецОбласти

#Область Операции_с_ДЯ

Процедура ЗагрузкаОперацийСДЯ(Знач КассаККМ = Неопределено, Оборудование = Неопределено, ДатаЗагрузкиДанных = Неопределено) Экспорт
	
	Если ДатаЗагрузкиДанных = Неопределено Тогда 
		ДатаЗагрузкиДанных = ТекущаяДата();
	КонецЕсли;
	
	Соединение = ПолучитьПараметрыПодключения(Ложь);
	
	ДатаОперации = ?(ЗначениеЗаполнено(ДатаЗагрузкиДанных), ДатаЗагрузкиДанных, ТекущаяДата());
	ДатаЗагрузки = Строка(Формат(ДатаОперации, "ДФ=yyyy-MM-dd")); 
	
	ИдМагазина = СтрЗаменить(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Оборудование, "ИндексМагазина"), Символы.НПП, "");
	
	АдресРесурса = "/api/v1/export/moneyOperation/" + ИдМагазина + "/" + СтрЗаменить(КассаККМ, Символ(160), "") + "/" + ДатаЗагрузки;
	
	НовыйЗапросHTTP = ПодготовитьHTTPЗапрос(, АдресРесурса); 
	ДанныеОпераций = Соединение.Получить(НовыйЗапросHTTP);
	
	Если ДанныеОпераций.КодСостояния = 200 Тогда 
		
		ЧтениеJSON = Новый ЧтениеJSON;  
		ЧтениеJSON.УстановитьСтроку(ДанныеОпераций.ПолучитьТелоКакСтроку());
		ДанныеОтвета = ПрочитатьJSON(ЧтениеJSON, Ложь);
		
		Если ДанныеОтвета.Количество() > 0 Тогда
			ОбработатьОперацииДенежногоЯщикаИзAPI(ДанныеОтвета, Оборудование);
		КонецЕсли;
		
	КонецЕсли;  
	
КонецПроцедуры 

Процедура ОбработатьОперацииДенежногоЯщикаИзAPI(ДанныеAPI, ОфлайнОборудование) Экспорт

	ТаблицаИнкассаций = Новый ТаблицаЗначений;
	ТаблицаИнкассаций.Колонки.Добавить("НомерКассы",           Новый ОписаниеТипов("Число"));
	ТаблицаИнкассаций.Колонки.Добавить("НомерСмены",           Новый ОписаниеТипов("Число"));
	ТаблицаИнкассаций.Колонки.Добавить("НомерДокумента",       Новый ОписаниеТипов("Число"));      // local_number
	ТаблицаИнкассаций.Колонки.Добавить("НомерДокументаГлоб",   Новый ОписаниеТипов("Число"));      // global_number
	ТаблицаИнкассаций.Колонки.Добавить("Дата",                 Новый ОписаниеТипов("Дата"));
	ТаблицаИнкассаций.Колонки.Добавить("СуммаВнесения",        Новый ОписаниеТипов("Число"));
	ТаблицаИнкассаций.Колонки.Добавить("СуммаИзъятия",         Новый ОписаниеТипов("Число"));
	ТаблицаИнкассаций.Колонки.Добавить("Кассир",               Новый ОписаниеТипов("Строка"));

	Для Каждого Элемент Из ДанныеAPI.elements Цикл
		
		НоваяСтрока = ТаблицаИнкассаций.Добавить();
		
		НоваяСтрока.НомерКассы           = Элемент.posId;
		НоваяСтрока.НомерСмены           = Элемент.shiftNumber;
		НоваяСтрока.НомерДокумента       = Элемент.localNumber;
		НоваяСтрока.НомерДокументаГлоб   = Элемент.globalNumber;
		НоваяСтрока.Дата                 = ПрочитатьДатуJSON(Элемент.opDate, ФорматДатыJSON.ISO);
		НоваяСтрока.Кассир               = Элемент.userId; // или userName, если в системе используется код кассира как число
		
		// Определяем тип операции
		Если Нрег(Элемент.opType) = "deposition" Тогда
			НоваяСтрока.СуммаВнесения = Элемент.amount;
			НоваяСтрока.СуммаИзъятия  = 0;
		ИначеЕсли Нрег(Элемент.opType) = "withdrawal" Тогда
			НоваяСтрока.СуммаИзъятия  = Элемент.amount;
			НоваяСтрока.СуммаВнесения = 0;
		Иначе
			// Неизвестный тип операции — пропускаем
			ТаблицаИнкассаций.Удалить(НоваяСтрока);
			Продолжить;
		КонецЕсли;
		
	КонецЦикла;

	ТаблицыОбработки = Новый Структура();
	ТаблицыОбработки.Вставить("ТаблицаСмен", Новый ТаблицаЗначений);
	ТаблицыОбработки.Вставить("ТаблицаИнкассаций", ТаблицаИнкассаций);
	
	ТекстОшибки = "";
	Отказ = Ложь;
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ПриЗагрузкеИнкассаций(ТаблицыОбработки, ОфлайнОборудование, Отказ, ТекстОшибки);

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область Общие_Процедуры_И_Функции	 

Функция ПолучитьПараметрыПодключения(Выгрузка = Истина) Экспорт
	
	ПараметрыПодключения = Новый Структура;
	ПараметрыПодключения.Вставить("АдресСервера",    "10.0.4.138"); // "185.17.141.70");
	ПараметрыПодключения.Вставить("Порт",            ?(Выгрузка, 30002, 30001)); //29017  
	ПараметрыПодключения.Вставить("apikey",          "");
	ПараметрыПодключения.Вставить("ИмяПользователя", "sarabeev");//"devops");
	ПараметрыПодключения.Вставить("Пароль",          "1");
	ПараметрыПодключения.Вставить("CURL_Запрос",     "");      
	ПараметрыПодключения.Вставить("Таймаут",         600);  
	
	//Соединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера, ПараметрыПодключения.Порт, ПараметрыПодключения.ИмяПользователя,ПараметрыПодключения.Пароль,, 120);
	Соединение = Новый HTTPСоединение(ПараметрыПодключения.АдресСервера, ПараметрыПодключения.Порт, ,,,600);
	
	Возврат Соединение;
	
КонецФункции

Функция ПолучитьТелоКакJSON(СтруктураЗапроса)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураЗапроса);
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

Функция ПодготовитьHTTPЗапрос(ТелоЗапроса = "", АдресРесурса, Куки = "")
	
	Запрос = Новый HTTPЗапрос();
	Запрос.Заголовки.Вставить("Accept", "application/json");
	Запрос.Заголовки.Вставить("Content-Type", "application/json");

	Если НЕ Куки = "" Тогда
		Запрос.Заголовки.Вставить("Cookie", Куки);
	КонецЕсли;
	
	Запрос.АдресРесурса = АдресРесурса; 
	
	Если ЗначениеЗаполнено(ТелоЗапроса) Тогда
		Запрос.Заголовки.Вставить("Content-Type", "application/json");
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	КонецЕсли;
	
	Возврат Запрос;
	
КонецФункции

Функция ПолучитьПоСтавкеНДСЗначениеДляВыгрузкиЧислом(СтавкаНДС)
	
	Если СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		ЗначениеНалога = 5;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС0 Тогда
		ЗначениеНалога = 4;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10 Тогда
		ЗначениеНалога = 0;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС10_110 Тогда
		ЗначениеНалога = 110;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18 Тогда
		ЗначениеНалога = 18;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС18_118 Тогда
		ЗначениеНалога = 118;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		ЗначениеНалога = 20;
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС20_120 Тогда
		ЗначениеНалога = 120;
	Иначе
		ЗначениеНалога = 1;
	КонецЕсли;
	
	Возврат ЗначениеНалога;
	
КонецФункции

Функция СписокМагазинов()
	
	СписокМагазиновДляВыгрузки = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПодключаемоеОборудование.Ссылка КАК Магазин
		|ИЗ
		|	Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
		|ГДЕ
		|	НЕ ПодключаемоеОборудование.ПометкаУдаления
		|	И ПодключаемоеОборудование.ДрайверОборудования = ЗНАЧЕНИЕ(Справочник.ДрайверыОборудования.ДрайверPOSУКМ5)
		|	И ПодключаемоеОборудование.ИндексМагазина > 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокМагазиновДляВыгрузки.Добавить(ВыборкаДетальныеЗаписи.Магазин);
	КонецЦикла;
	
	Возврат СписокМагазиновДляВыгрузки;
	
КонецФункции 

Процедура ЗаполнениеИнформацииОВыгрузки(Знач МассивДанных)
	
	//Информация.Очистить();
	
	Для Каждого СтрокаДанных ИЗ МассивДанных Цикл 
		Текст = "";
		Для Каждого Колонка Из СтрокаДанных Цикл
			Текст = Текст + Колонка.Ключ + " " + Колонка.значение + "; ";       
		КонецЦикла;   
		//Информация.ДобавитьСтроку(Текст); 
	КонецЦикла;
	
КонецПроцедуры



#КонецОбласти
